using System;
using System.Collections.Generic;
using System.ComponentModel.DataAnnotations;
using System.Text;

namespace DataLayer.SSOT.Promotion
{
    /// <summary>
    /// نوع طرح یا پروژه با استفاده از این فایل مشخص می‌شود
    /// </summary>
    public enum ProjectPromotionSSOT
    {
        [Display(Name = "تدوین و به تصویب رساندن طرح یا پروژه پژوهشی (در سطح پژوهشگاه(امانی))")]
        A_A = 1,
        
        [Display(Name = "تدوین و به تصویب رساندن طرح یا پروژه پژوهشی (در سطح صنعت)")]
        A_B = 2,
        
        [Display(Name = "تدوین و به تصویب رساندن طرح یا پروژه پژوهشی (در سطح ملی)")]
        A_C = 3,

        [Display(Name = "تدوین و تصویب استاندارد / اسناد ملی و راهبردی در حوزه فناوری")]
        B = 4,

        [Display(Name = "تهیه یا همكاری در تهیه گزارش مرحلهای/نهایی (در سطح پژوهشگاه(امانی))")]
        C_A = 5,
        
        [Display(Name = "تهیه یا همكاری در تهیه گزارش مرحلهای/نهایی (در سطح صنعت)")]
        C_B = 6,
        
        [Display(Name = "تهیه یا همكاری در تهیه گزارش مرحلهای/نهایی (در سطح ملی)")]
        C_C = 7,

        [Display(Name = "طراحی و راه اندازی آزمایشگاههای تخصصی(حسب اهمیت، تجهیزات موجود و میزان بهره برداری)")]
        D = 8,
        
        [Display(Name = "طراحی و تأسیس مراكز تحقیقاتی، مراكز رشد و شركت‌های دانش بنیان")]
        E = 9,
       
        [Display(Name = "داوری طرح یا پروژه پژوهشی، طرح استاد، پروژه‌های برون سپاری شده، پایان نامه و ...")]
        F = 10,
        
        [Display(Name = "نظارت طرح یا پروژه پژوهشی، پروژه‌های برون سپاری شده، طرح استاد و ...")]
        G = 11,
        
        [Display(Name = "مدیریت پروژه‌ها و طرح‌ها")]
        H = 12,
        
        [Display(Name = "مجریگری طرح‌ها و پروژه‌ها")]
        I = 13,


    }
}
